In [1]:
import pandas as pd

In [13]:
student_list = {
    "name":
    ["John", "Nate", "Yuna", "Abraham", "Brian", "Janny", "Nate", "John"],
    "job": [
        "teacher", "teacher", "teacher", "student", "student", "student",
        "teacher", "student"
    ],
    "age": [40, 35, 37, 10, 12, 11, None, None]
}
df = pd.DataFrame(student_list)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [14]:
# 전체 행의 개수와 컬럼 개수 확인하기

df.shape

(8, 3)

In [15]:
# age가 NaN 인 것 찾기 -  age 부분이 Non-Null Count 값의 개수를 보면 8개가 아니라 6임을 알 수 있음

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [6]:
# 또 다른 방법으로 NaN 확인하기

df.isnull()

    name  major    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [7]:
# 또 다른 방법으로 NaN 확인하기


df.isna()

    name  major    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [16]:
# NaN 값을 확인한 후 다른 값으로 변경하기

# df프레임의 age 필드에서 na 값을 찾아서 0으로 채워줘
df.age = df.age.fillna(0)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

<b>* 상식적으로 나이가 0인 것은 말이 안되니까 그럴듯하게 변경하기</b><br>
<b>* 선생님의 나이는 다른 선생님들 나이의 평균값으로, 학생들의 나이또한 평균값으로 변경하기</b>

In [17]:
# df 값이 변경이 되었기 때문에 다시 한번 생성하기

student_list = {
    "name":
    ["John", "Nate", "Yuna", "Abraham", "Brian", "Janny", "Nate", "John"],
    "job": [
        "teacher", "teacher", "teacher", "student", "student", "student",
        "teacher", "student"
    ],
    "age": [40, 35, 37, 10, 12, 11, None, None]
}
df = pd.DataFrame(student_list)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [39]:

# transform : 각 그룹에 대해 transform() 에 제시된 값으로 변경시켜 버림
# job으로 그룹 설정 후 나이만 보기 / 나이의 중간값으로 나이 필드 값을 변경시켜 줘
df.groupby('job')['age'].transform("median")

0    37.0
1    37.0
2    37.0
3    11.0
4    11.0
5    11.0
6    37.0
7    11.0
Name: age, dtype: float64

In [40]:
# 나이의 모든 값을 동일한 값으로 변경할 게 아니고 NaN 인 것만 변경할꺼니까
# inplace = True : df 에 바로 반영시켜줘

df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0